# HO_GetHoistOriginAt

## Description
Get the name of the Hoist Origin at the given position.

```pascal
FUNCTION HO_GetHoistOriginAt(index : LONGINT) : STRING;
```

```python

def vs.HO_GetHoistOriginAt(index):
    return STRING
```

## Parameters
|Name|Type|Description|
|---|---|---|
|index|LONGINT||

## Version
Availability: from Vectorworks 2018
## Category
* Spotlight